Revit 2024 API
BRepBuilderPersistentIds.AddSubTag Method
 Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId. Note that an existing correspondence in the map cannot be updated and that a particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void AddSubTag(
	ExternalGeometryId externalGeometryId,
	BRepBuilderGeometryId brepBuilderGeometryId
)
Visual Basic
Public Sub AddSubTag ( _
	externalGeometryId As ExternalGeometryId, _
	brepBuilderGeometryId As BRepBuilderGeometryId _
)
Visual C++
public:
void AddSubTag(
	ExternalGeometryId^ externalGeometryId,
	BRepBuilderGeometryId^ brepBuilderGeometryId
)
Parameters
externalGeometryId
Type: Autodesk.Revit.DB.ExternalGeometryId
 An external geometry object Id.
brepBuilderGeometryId
Type: Autodesk.Revit.DB.BRepBuilderGeometryId
 A BRepBuilder geometry object Id. It must represent the ID of either a Face or an Edge.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  externalGeometryId cannot be used to create a new correspondence because it is already used. -or- brepBuilderGeometryId cannot be used to create a new correspondence because it is already used. -or- brepBuilderGeometryId cannot be used to create a new correspondence because it doesn't represent the ID of either a Face or an Edge.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The associated BRepBuilder doesn't exist or is not valid (has no Faces and no Edges).
See Also
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace